{
    "recipes": [
        {
            "recipe": "Chicken Biryani",
            "ingred": [
                "Chicken",
                "Ghee",
                "Cloves",
                "Onion",
                "Chilli",
                "Salt",
                "Water"
            ],
            "utube":"https://youtu.be/TRw8lPKXofU",
            "method": "Step 1 Soak rice for 30 minutes in enough water to cover; then drain. \n Step 2 Meanwhile, heat ghee in a large skillet over medium heat. Stir in cloves, cardamom, and bay leaves. Then stir in onion, and cook until soft, 6 to 7 minutes. Stir in chile peppers and ginger paste. Stir in yogurt, salt, and curry, and then place chicken in pan. Cook for 20 to 25 minutes, stirring occasionally and turning the chicken pieces, until only about 1 cup of liquid remains. Step 3 Mix in rice, water, and cilantro. Bring to a boil. Reduce heat to low, cover, and cook for 20 minutes. Check rice after about 12 minutes; if it is dry, add 1/2 cup water, and continue cooking."
        },
        {
            "recipe": "Pepper Mutton",
            "ingred": [
                "Onion",
                "Curry leaves",
                "Peppercorns",
                "Coriander",
                "Water",
                "Pepper",
                "Mutton"
            ],
            "utube":"https://youtu.be/zVWi00sECJo",
            "method": "Step 1 Heat 1 teaspoon of oil in a saucepan over medium heat. Stir in the chopped onion, and cook until the onion turns translucent and the edges begin to brown, about 7 minutes. Scrape the onion into the container of a blender, and set aside.Step 2Return the saucepan to the stove, and stir in the curry leaves and peppercorns. Cook and stir until the curry leaves wilt and turn almost dry, about 5 minutes. Stir in the coriander, and cook 1 minute more. Scrape the curry leaves into the blender, and pour in 1/2 cup of water. Blend until the mixture has turned into a coarse paste.Step 3Heat 3 tablespoons of oil in the saucepan over medium heat. Stir in the sliced onions, and cook until the onions have softened and turned translucent, about 5 minutes. Stir in the ginger and garlic, continue cooking until the garlic softens and mellows, about 3 minutes more. Stir in the cayenne pepper, salt, and turmeric; continue cooking 2 minutes.Step 4:Mix in the tomato paste, goat meat, pureed peppercorn sauce, and the remaining 1/2 cup of water. Bring to a simmer, then reduce heat to medium-low, cover, and simmer until the meat is tender, about 30 minutes."
        },
        {
            "recipe": "Shrimp gravy",
            "ingred": [
                "Oil",
                "Onion",
                "Curry leaves",
                "Ginger",
                "Garlic",
                "Coriander"
            ],
            "utube":"https://youtu.be/u6NWgjb5Qoc",
            "method": "Step 1 Heat the oil in a wok or large saucepan over nearly high heat. Add the onions; cook and stir until browned. Mix in the curry leaves, then season with the ginger garlic paste, coriander and salt. Cook and stir for 1 minute.Step 2 Season with salt and turmeric, then mix in the tomato, chile powder, shrimp and water. Reduce the heat to medium-high and cook for 7 to 8 minutes, until shrimp are opaque. Taste and adjust salt and chile powder if necessary. Season with garam masala, stir and remove from the heat. Garnish with fresh cilantro and serve with flat bread or rice."
        },
        {
            "recipe": "Chicken gravy",
            "ingred": [
                "Tomato",
                "Chicken",
                "Potatoes",
                "Vinegar",
                "Salt",
                "Turmeric",
                "Coriander"
            ],
            "utube":"https://youtu.be/AoPqKq4Wv_E",
            "method": "Toast the turmeric, cardamom, cinnamon, coriander, cloves, cumin, paprika, and cayenne pepper in a Dutch oven or large pot over medium-low heat until the spices are fragrant, about 2 minutes. Stir the spices constantly as they toast, taking care that they do not burn. Stir in the olive oil, onion, garlic, and ginger. Increase heat to medium, and cook until softened, about 5 minutes.Step 2 Toast the turmeric, cardamom, cinnamon, coriander, cloves, cumin, paprika, and cayenne pepper in a Dutch oven or large pot over medium-low heat until the spices are fragrant, about 2 minutes. Stir the spices constantly as they toast, taking care that they do not burn. Stir in the olive oil, onion, garlic, and ginger. Increase heat to medium, and cook until softened, about 5 minutes."
        },
        {
            "recipe": "Ada (Adai)",
            "ingred": [
                "Bengal gram",
                "Lentils",
                "Rice",
                "Peppers",
                "Cumin seeds",
                "Oil"
            ],
            "utube":"https://youtu.be/QkMNoZ4LRtA",
            "method": "Step 1 Place the chana dal, urad dal, moong dal, and rice into a large bowl and cover with several inches of cool water; allow to soak 8 hours to overnight.Step 2Grind the soaked dal and rice with the salt and red chile peppers into a paste using a mortar and pestle. Add enough water to the mixture to make a batter just thin enough to spread. Stir the cumin seeds into the batter Step 3Heat a griddle (or a tawa) over medium heat. Gently grease the griddle with oil on the edges and the middle. Ladle the batter on the tawa and spread into a thin circle using the back of the ladle or a large spoon. Cook for a few minutes and flip over to the other side. Cook a few more minutes, transfer to a plate, and serve immediately. Adas are best eaten hot off the griddle."
        },
        {
            "recipe":"Ven Pongal",
            "ingred":[
                "Rice",
                "Lentils",
                "Ghee",
                "Salt",
                "Pepper",
                "Cumin",
                "Water"
            ],
            "method":"Heat a large skillet over medium heat; add rice and lentils. Cook and stir until toasted and fragrant, 3 to 4 minutes. Rinse. Step 2 Place rice-lentil mixture, 1 tablespoon ghee, and salt in a rice cooker or pressure cooker; add water. Cook according to manufacturer's instructions until rice and lentils are tender and the consistency of a paste, 20 to 25 minutes. Stir and mash into a fine paste. Step 3 Heat 1 tablespoon ghee in a skillet over medium-high heat. Add black pepper and cumin seeds; cook until seeds start to pop, 2 to 3 minutes. Stir cumin mixture into rice-lentil mixture. Step 4 Tear curry leaves roughly and stir into rice-lentil mixture; stir in ginger. Season with salt.Step 5 Heat remaining 1 tablespoon ghee in a skillet over medium-high heat; cook and stir cashews until toasted and fragrant, 2 to 4 minutes. Garnish rice-lentil mixture with toasted cashews."
        },
        {
            "recipe":"Malai Kulfi",
            "ingred":[
                "Milk",
                "Sugar",
                "Cardamom",
                "Pista"
            ],
            "utube":"https://youtu.be/f6D7A6-QNl8",
            "method":"Stir the milk, condensed milk, and dry milk powder together in a heavy-bottomed pan and bring to a boil. Add the sugar, cardamom, and saffron to the boiling milk; reduce heat to low and simmer, stirring frequently, for 10 minutes. Remove from heat and allow to cool to room temperature; fold the pistachio nuts into the mixture. Pour the mixture into popsicle molds and freeze until solid, about 1 hour."
        },
        {
            "recipe":"Idly",
            "ingred":[ 
                "Oil",
                "Bengal gram",
                "Rava",
                "Water",
                "Chilli",
                "Pepper"
            ],
            "utube":"https://youtu.be/9wmXpHn8KCs",
            "method":"Heat vegetable oil in a pan over medium-low heat. Add mustard seeds, cumin seeds, and chana dal and saute for a few seconds. Add curry leaves, dried red chile, cashews, ginger, green chile peppers, and hing and saute until cashew nuts turn slightly brown, 3 to 4 minutes. Add semolina and cook and stir over low heat until slightly browned; remove mixture to a plate and let cool completely, about 10 minutes. Add yogurt and carrot to the mixture and mix well. Add water as needed to reach desired consistency. Season with salt to taste. Cover and let sit for 15 minutes. Check batter consistency again; add more water if needed.Grease an idli pan and add water to steam; bring to a boil.Meanwhile, add fruit salt to the batter, mix well, and then pour the batter in the greased molds.Steam the idli for 10 minutes. Remove the idli from the molds and serve."
        },
        {
            "recipe":"Gobi Manchurian",
            "ingred":[
                "Oil",
                "Flour",
                "Onion",
                "Cauliflower",
                "Garlic",
                "Chilli"
            ],
            "utube":"https://youtu.be/SxqUj4zJVN4",
            "method":"Heat oil in a large pot over medium heat. Mix flour, cornmeal, water, black pepper, and salt together in a bowl to make a thick batter. Toss in cauliflower florets and mix until coated. Deep fry cauliflower a few florets at a time until golden brown, about 3 minutes. Transfer to a paper towel-lined plate. Mix 1/4 cup vegetable stock with cornmeal in a bowl. Add soy sauce, ketchup, chile-garlic sauce, and salt. Heat oil in a wok or frying pan over high heat. Add onions, chile pepper, garlic, and ginger and stir-fry for a few seconds. Add cornmeal mixture and cook 1 to 2 minutes. Add remaining vegetable stock and cook until very thick, about 10 minutes. Remove sauce from heat. Spoon sauce over fried cauliflower and toss slightly. Garnish with green onions and serve."
        }
    ]
}